---
layout: post
title:  "交换机 MTU 配置总结"
date:   2017-09-18
categories: NSX
tags: NSX VXLAN MTU 交换机
typora-root-url: ../../halfcoffee
---

* content
{:toc}
> 摘要：在使用基于 VXLAN 的 SDN 解决方案时，对物理网络的基本要求是修改 MTU，让其大于1600 (NSX)，下面总结了几大厂商不同型号或版本交换机的配置，以后会不断更新，也请有过配置经验的同行帮忙补充

本文 PDF 下载链接 ：[点击下载](../pdfs/Switch-MTU.pdf)

## 配置简介

一般配置 MTU 时，需要配置端到端沿途所有设备，如果源和目标在同一个网段，则只需要配置沿途所有设备的二层接口MTU。一般按照设备不同，可能需要全局配置 MTU，或者在对应接口上配置MTU。

如果源和目的在不同的网段内，除了配置沿途所有二层接口 MTU 外，还需配置两个网段网关接口(三层接口)的 MTU。

一般配置方式是 interface vlan 100，mtu 1600。

## Cisco

### Nexus 系列交换机

参考资料：[https://www.cisco.com/c/en/us/support/docs/switches/nexus-9000-series-switches/118994-config-nexus-00.html](https://www.cisco.com/c/en/us/support/docs/switches/nexus-9000-series-switches/118994-config-nexus-00.html)

#### 三层 MTU

SVI 接口配置：

```
Switch(config)#interface vlan 1
Switch(config-if)#mtu 9216
```

三层物理接口配置：

```
Switch(config)#interface ethernet 1/1
Switch(config-if)#no switchport
Switch(config-if)#mtu 9216
```

#### 二层MTU

二层MTU可以通过Qos或者基于端口进行配置。目前只有 Nexus 7000, 7700, 9300, 和 9500 支持端口配置 MTU。
**Nexus 3048, 3064, 3100, 3500, 5000, 5500, 及 6000 配置方式**
此配置会对所有接口生效

```
policy-map type network-qos jumbo
  class type network-qos class-default
      mtu 9216
system qos
  service-policy type network-qos jumbo
```

**Nexus 7000, 7700, 9300, 及 9500 配置方式**

以下为基于接口的配置方式：

```
Switch(config)#interface ethernet 1/1
Switch(config-if)#mtu 9216
```



**Nexus 2000 配置**

>  注意，Nexus 2000 MTU 配置需要在其父 FEX 交换机上进行配置，如果父交换机支持接口下配置MTU，则在对应接口下配置，如果不支持，则需要使用**network-qos**。

**需要注意，使用 FEX 时，Fabric Port Channel (FPC) ，也就是连接 FEX 的端口聚合组也需要配置 MTU**

```
interface port-channel136
  switchport mode fex-fabric
  fex associate 136
  vpc 136
  mtu 9216
```

> **注意:** 在 6.2 版本以后，Nexus 7000 不支持给 Fabric Port Channel 接口直接配置MTU，必须创建一个 QoS 策略来全局调整 MTU。

```
policy-map type network-qos jumbo
  class type network-qos class-default
    mtu 9216
system qos
  service-policy type network-qos jumbo
```

#### 验证

##### 三层 MTU

所有 Nexus 系列交换机都可以通过`show interface eth x/y`命令来查看接口 MTU：

```
Nexus#show interface ethernet 1/19
Ethernet1/19 is up
Dedicated Interface
Hardware: 100/1000/10000 Ethernet, address: 547f.ee5d.413c (bia 547f.ee5d.40fa)
MTU 9216 bytes, BW 1000000 Kbit, DLY 10 usec
```

使用 `show interface vlan X`命令查看 SVI 接口MTU：

```
Leaf3#show interface vlan 1
Vlan1 is down (Non-routable VDC mode), line protocol is down
  Hardware is EtherSVI, address is  547f.eed8.ec7c
  Internet Address is 1.1.1.1/23
  MTU 9216 bytes, BW 1000000 Kbit, DLY 10 usec
```

##### 二层 MTU

**Nexus 3100, 3500, 5000, 5500, 及 6000**

```
Nexus#show queuing interface ethernet 1/1
Ethernet1/1 queuing information:
  TX Queuing
    qos-group  sched-type  oper-bandwidth
        0       WRR            100
  RX Queuing
    qos-group 0
    q-size: 469760, HW MTU: 9216 (9216 configured)   
```

**Nexus 3000, 7000, 7700, 及 9000**

```
Nexus#show interface ethernet 1/12
Ethernet1/12 is up
admin state is up, Dedicated Interface
  Hardware: 1000/10000 Ethernet, address: 7c0e.ceca.f183 (bia 7c0e.ceca.f183)
  MTU 9216 bytes, BW 10000000 Kbit, DLY 10 usec 
```

**Nexus 5000, 6000, 及 7000 的 FEX 接口**

```
Nexus#show queuing interface ethernet 136/1/1
if_slot 68, ifidx 0x1f870000
Ethernet136/1/1 queuing information:
  Input buffer allocation:
  Qos-group: 0
  frh: 3
  drop-type: drop
  cos: 0 1 2 3 4 5 6 7
  xon       xoff      buffer-size
  ---------+---------+-----------
  19200     78080     90880

  Queueing:
  queue   qos-group    cos                 priority     bandwidth     mtu 
--------+------------+--------------------+---------+----------------+--------
  3                   0        0 1 2 3 4 5 6      WRR       100       9280
```

**Nexus 9000 的FEX 接口 **

```
9396-B#show interface ethernet 104/1/1
Ethernet104/1/1 is up
admin state is up,
  Hardware: 100/1000 Ethernet, address: 5475.d0e0.e5c2 (bia 5475.d0e0.e5c2)
  MTU 9216 bytes, BW 1000000 Kbit, DLY 10 usec
```



### Catalyst 4500系列交换机

> 已知可用交换机版本：C4506 IOS 12.2

Cisco C4500系列交换机请检查板卡兼容性，一些老设备可能无法支持MTU>1570 [https://www.cisco.com/c/en/us/support/docs/switches/catalyst-4000-series-switches/29805-175.html#topic3](https://www.cisco.com/c/en/us/support/docs/switches/catalyst-4000-series-switches/29805-175.html#topic3)

#### 二层接口MTU（只能全局配置）

`system mtu 1600 `

检查命令：`show system mtu`或者

```
show interface G0/0

 GigabitEthernet1/3 is up, line protocol is up (connected) 
  Hardware is Gigabit Ethernet Port, address is 588d.097e.9982 (bia 588d.097e.9982)
 MTU 1600 bytes, BW 1000000 Kbit, DLY 10 usec, 
  reliability 255/255, txload 6/255, rxload 21/255
  Encapsulation ARPA, loopback not set
```

#### 三层接口MTU


```
interface vlan 200
mtu 9000
```

### 2960、3560、3750

> 2960 IOS 12.2 ，3560 12.2，3750 15.0

**全局配置FastEthernet接口MTU：**

`system mtu 1600`

#### 全局配置GigabitEthernet接口MTU

**(如果不配置，则继承system mtu配置)：**

`system mtu jumbo 1600`

#### 三层接口 MTU

**全局** ：`system mtu routing 1600`

**接口下**（接口下优先）：

```
interface vlan 100
 mtu 1600
```

### 大包测试

```
!-- 从交换机SW1 ping SW2，1570 字节的包，成功

SW1#ping 192.168.12.2 size 1550 df-bit
Type escape sequence to abort.
Sending 5, 1550-byte ICMP Echos to 192.168.12.2, timeout is 2 seconds:
Packet sent with the DF bit set
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/202/1006 ms
```

```
!-- 从交换机SW1 ping SW2 ，1600 字节的包，失败

SW1#ping 192.168.12.2 size 1600 df-bit 
Type escape sequence to abort.
Sending 5, 1600-byte ICMP Echos to 192.168.12.2, timeout is 2 seconds:
Packet sent with the DF bit set
.....
Success rate is 0 percent (0/5)
```

```
!-- 在SW2的 f0/13 口可以看到失败的包(5 giants) 

SW2#sh int f0/13 | in (MTU|giants|packets )
  MTU 1550 bytes, BW 100000 Kbit, DLY 100 usec,
82 packets input, 23609 bytes, 0 no buffer
0 runts, 5 giants, 0 throttles
0 input packets with dribble condition detected
749 packets output, 64729 bytes, 0 underruns
```



## 华为

###  S1700，2700，5700，CE系列

#### 二层接口MTU

命令支持Ethernet接口视图、GE接口视图、XGE接口视图、MultiGE接口视图、40GE接口视图、端口组视图、Eth-Trunk接口视图

```
<HUAWEI> system-view
[HUAWEI] interface gigabitethernet 0/0/1
[HUAWEI-GigabitEthernet0/0/1] jumboframe enable 5000
```

#### 三层MTU

```
[HUAWEI] interface Vlanif 100
[HUAWEI-Vlanif100] mtu 1600
```

``` 
[HUAWEI] interface gigabitethernet 0/0/1
[HUAWEI-GigabitEthernet0/0/1] undo portswitch
[HUAWEI-GigabitEthernet0/0/1] mtu 1600
```

某些设备需要重启接口生效：`[HUAWEI-GigabitEthernet0/0/1] restart`

## 华三

### S6300、S5800、S7500、S10500、S5120

#### 二层接口MTU

```
interface G1/1
jumboframe enable 6000

! 聚合组配置 Jumbo Frame
interface Bridge-Aggregation1
jumboframe enable 6000
```

#### 三层MTU

```
[H3C] interface Vlanif 100
[H3C-Vlanif100] mtu 1600
```

```
在某些软件版本下，需要使用 ip mtu 1600 命令来调整
```



## 锐捷

### S8610 

 > version11

#### 三层接口MTU

```
interface interface AggregatePort 10
no switchport
mtu 9216
```

### 检查

```
show interface agg 10
AggregatePort 10 is UP  , line protocol is UP   
  Hardware is AggregateLink AggregatePort, address is 1414.4b82.25e1 (bia 1414.4b82.25e1)
  Description: Link-To-Gold3_HR_VmWare
  Interface address is: 172.16.1.1/24
  ARP type: ARPA, ARP Timeout: 3600 seconds
  Interface IPv6 address is:
No IPv6 address
MTU 9216 bytes, BW 20000000 Kbit
```